app/Controllers/Capacitacion.php

            public function index2(){
                $capuser =new Cap_usuariosModel();
                $user = new UserModel();
                $cap = new CapacitacionModel();
                $datos=$capuser->orderBy('id_usuario_capacitacion','ASC')->findAll();
                $datos_cap_usuarios=$capuser->orderBy('id_usuario_capacitacion','ASC')->datos_usuarios();

                $datos_usuario=$user->orderBy('id_usuario', 'ASC')->findAll();
                $datos_capacitacion=$cap->orderBy('id_capacitacion', 'ASC')->findAll();
---
SELECT *
FROM `usuario_capacitacion`
ORDER BY `id_usuario_capacitacion` ASC
SELECT *
FROM `usuario`
ORDER BY `id_usuario` ASC
SELECT *
FROM `capacitacion`
ORDER BY `id_capacitacion` ASC