app/Controllers/Usuarios.php

    public function index(){
        $users =new UserModel();
        $datos_carr=$users->orderBy('id_usuario','ASC')->datos_carr();
        $datos_user=$users->orderBy('id_usuario','ASC')->findAll();
        $carre =new CarreraModel();
        $editar_carr=$carre->orderBy('id_carrera','ASC')->findAll();
---
SELECT *
FROM `usuario`
ORDER BY `id_usuario` ASC, `id_usuario` ASC
SELECT *
FROM `carrera`
ORDER BY `id_carrera` ASC

public function registro(){
    $user =new CarreraModel();
    $datos['carrera']=$user->orderBy('id_carrera','ASC')->findAll();
---
SELECT *
FROM `carrera`
ORDER BY `id_carrera` ASC

    public function eliminar($id){
        $modelo = new UserModel();
        $modelo->where('id_usuario', $id)->delete($id);
---
DELETE FROM `usuario`
WHERE `id_usuario` = '25'
AND `id_usuario` IN ('25')