app/Models/Cap_usuariosModel.php

     public function datos_usuarios(){
        $builder = $this->db->table('usuario_capacitacion');
        $builder->select('usuario_capacitacion.*, usuario.nombre_usuario, usuario.apellidos_usuario, capacitacion.nombre_capacitacion');
        $builder->join('usuario', 'usuario_capacitacion.id_usuario = usuario.id_usuario');
        $builder->join('capacitacion', 'usuario_capacitacion.id_capacitacion = capacitacion.id_capacitacion');
        $query = $builder->get();
---
SELECT `usuario_capacitacion`.*, `usuario`.`nombre_usuario`, `usuario`.`apellidos_usuario`, `capacitacion`.`nombre_capacitacion`
FROM `usuario_capacitacion`
JOIN `usuario` ON `usuario_capacitacion`.`id_usuario` = `usuario`.`id_usuario`
JOIN `capacitacion` ON `usuario_capacitacion`.`id_capacitacion` = `capacitacion`.`id_capacitacion`