app/Models/PrestamoModel.php

SELECT `prestamo`.*, `equipo`.`nombre_equipo`, `usuario`.`matricula`, `laboratorio`.`nombre_laboratorio`, `fecha_prestamo`, `hora_fin_prestamo`, `observacion_prestamo`
FROM `prestamo`
JOIN `equipo` ON `prestamo`.`id_equipo` = `equipo`.`id_equipo`
JOIN `laboratorio` ON `prestamo`.`id_laboratorio` = `laboratorio`.`id_laboratorio`
JOIN `usuario` ON `prestamo`.`id_usuario` = `usuario`.`id_usuario`
WHERE `matricula` = '202267533'
---
    public function datos_prestamos(){
        $session = session();
        $matri = $session->get("matricula");
        $builder = $this->db->table('prestamo');
        $builder->select('prestamo.*, equipo.nombre_equipo, usuario.matricula, laboratorio.nombre_laboratorio, fecha_prestamo, hora_fin_prestamo, hora_inicio_prestamo, observacion_prestamo');
        $builder->join('equipo', 'prestamo.id_equipo = equipo.id_equipo');
        $builder->join('laboratorio', 'prestamo.id_laboratorio = laboratorio.id_laboratorio');
        $builder->join('usuario', 'prestamo.id_usuario = usuario.id_usuario');
        $builder->where('matricula', $matri);

        $query = $builder->get();