app/Models/UserModel.php

SELECT `usuario`.*, `carrera`.`nombre_carrera`
FROM `usuario`
JOIN `carrera` ON `usuario`.`id_carrera` = `carrera`.`id_carrera`
---
    public function datos_carr(){
        $builder = $this->db->table('usuario');
        $builder->select('usuario.*, carrera.nombre_carrera');
        $builder->join('carrera', 'usuario.id_carrera = carrera.id_carrera');
        $query = $builder->get();

SELECT `usuario`.*, `usuario`.`matricula`, `usuario_capacitacion`.`fecha_fin_capacitacion`, `usuario_capacitacion`.`fecha_inicio_capacitacion`, `capacitacion`.`nombre_capacitacion`, `capacitacion`.`duracion_capacitacion`, `capacitacion`.`nombre_instructor`
FROM `usuario`
JOIN `usuario_capacitacion` ON `usuario`.`id_usuario` = `usuario_capacitacion`.`id_usuario`
JOIN `capacitacion` ON `usuario_capacitacion`.`id_capacitacion` = `capacitacion`.`id_capacitacion`
WHERE `matricula` = '202267533'
---
    public function datos_capacitacion(){
        $session = session();
        $matri = $session->get("matricula");
        $builder = $this->db->table('usuario');
        $builder->select('usuario.*, usuario.matricula, usuario_capacitacion.fecha_fin_capacitacion, usuario_capacitacion.fecha_inicio_capacitacion,
        capacitacion.nombre_capacitacion, capacitacion.duracion_capacitacion, capacitacion.nombre_instructor');
        $builder->join('usuario_capacitacion', 'usuario.id_usuario = usuario_capacitacion.id_usuario');
        $builder->join('capacitacion', 'usuario_capacitacion.id_capacitacion = capacitacion.id_capacitacion');
        $builder->where('matricula', $matri);

        $query = $builder->get();